000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектУчтенВNavision/ОбъектУчтенВNavision.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектУчтенВNavision</name>
  <resources>
    <name>ВидПередачи</name>
    <type>
      <types>EnumRef.ВидыПередачиNavision</types>
    </type>
  </resources>
  <resources>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчтеноNavision</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаТребуется</name>
    <comment>Команда из КСУ - отменить документ!</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаАкцептована</name>
    <comment>Отмена действия акцептована в периферии</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаНевозможна</name>
    <comment>Документ уже поступил в обработку или обработан</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КассовыйДень</name>
    <comment>Используется при выгрузке продаж за день (Кассовый День)</comment>
    <type>
      <types>DocumentRef.КассовыйДень</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьNavision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.КорректировкаПеремещения</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
      <types>DocumentRef.ПереоценкаТоваровНаСкладах</types>
      <types>DocumentRef.РегистрацияПодсчетаПосетителей</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриказНаПроведениеИнвентаризацииТоваров</types>
      <types>DocumentRef.КассоваяСмена</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
      <types>DocumentRef.ПрименениеЦенНоменклатуры</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПересчетТоваровСамостоятельный</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.РегистрацияБезналичнойОплаты</types>
      <types>DocumentRef.ОплатаОтПокупателяПлатежнойКартой</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ОрдерНаПеремещениеТоваров</types>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
      <types>DocumentRef.УстановкаЦенНоменклатуры</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.КассовыйДень</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <comment>Ресурс предназначен для фильтрации в правилах регистрации</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыПередачиNavision/ВидыПередачиNavision.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПередачиNavision</name>
  <comment>Виды передачи в/из Navision</comment>
  <enumValues>
    <name>ПереданВNavision</name>
    <comment>Объект и блокирован в Рознице и синхронизирован в Navision</comment>
  </enumValues>
  <enumValues>
    <name>ПолученИзNavision</name>
    <comment>Объект является внешним, то есть полученным из Navision.</comment>
  </enumValues>
  <enumValues>
    <name>ТолькоБлокирован</name>
    <comment>Объект не требует синхронизации с Navision</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектУчтенВNavision/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)

	Если ИзменениеРазрешено(Отказ) Тогда

		Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда

			Если Элемент.ТекущиеДанные.УчтеноNavision
			ИЛИ  Элемент.ТекущиеДанные.ВидПередачи = ПредопределенноеЗначение("Перечисление.ВидыПередачиNavision.ПолученИзNavision") Тогда

				ОчиститьСообщения();
				Сообщить("Удаление записи невозможно - это внешняя отметка! Отказано.");
				Отказ = Истина;

			КонецЕсли;

			Если НЕ Отказ Тогда

				РегистрацияУдаленияЗаписи(Элемент.ТекущиеДанные.Объект, Элемент.ТекущиеДанные.Магазин);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	ИзменениеРазрешено(Отказ);

КонецПроцедуры

&НаСервере
Функция ИзменениеРазрешено(Отказ)

	Если НЕ ТехническаяПоддержкаВызовСервера.ИсключительныйРежим() = Истина Тогда

		Отказ = Истина;
		Сообщить("Не установлен режим разрешения! Отказано.");

	КонецЕсли;

	Возврат НЕ Отказ;

КонецФункции // ИзменениеРазрешено()

&НаСервере
Процедура РегистрацияУдаленияЗаписи(Объект, Магазин)

	ЖурналСобытий.Регистрация("ОбъектУчтенВNavision.Удаление", УровеньЖурналаРегистрации.Предупреждение
	, Объект.Метаданные(), Объект,
	, "Удалена запись по магазину «" + Магазин + "»", СокрЛП(Объект), Истина);

КонецПроцедуры

&НаКлиенте	//	LNK 11.09.2020 08:08:04
Процедура СписокПослеУдаления(Элемент)

	Оповестить("ИзменениеОбъектУчтенВNavision");

КонецПроцедуры

&НаКлиенте	//	LNK 11.09.2020 08:09:54
Процедура СписокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Оповестить("ИзменениеОбъектУчтенВNavision");

КонецПроцедуры
